#map = affine_map<(d0, d1, d2, d3) -> (d0, d1, d2, d3)>
#map1 = affine_map<(d0, d1) -> (d0, d1)>
#map2 = affine_map<(d0, d1) -> (d1)>
#map3 = affine_map<(d0, d1) -> (d0)>
#map4 = affine_map<(d0, d1) -> (d0, 0)>
module {
  func.func @cnn_model(%arg0: tensor<1x1x28x28xf32>) -> tensor<1x10xf32> {
    %cst = arith.constant dense_resource<torch_tensor_6_torch.float32> : tensor<6xf32>
    %c0_i64 = arith.constant 0 : i64
    %cst_0 = arith.constant 0.000000e+00 : f32
    %cst_1 = arith.constant 0xFF800000 : f32
    %cst_2 = arith.constant dense_resource<torch_tensor_6_1_3_3_torch.float32> : tensor<6x1x3x3xf32>
    %cst_3 = arith.constant dense_resource<torch_tensor_16_6_3_3_torch.float32> : tensor<16x6x3x3xf32>
    %cst_4 = arith.constant dense_resource<torch_tensor_16_torch.float32> : tensor<16xf32>
    %cst_5 = arith.constant dense_resource<torch_tensor_120_400_torch.float32> : tensor<120x400xf32>
    %cst_6 = arith.constant dense_resource<torch_tensor_120_torch.float32> : tensor<120xf32>
    %cst_7 = arith.constant dense_resource<torch_tensor_84_120_torch.float32> : tensor<84x120xf32>
    %cst_8 = arith.constant dense_resource<torch_tensor_84_torch.float32> : tensor<84xf32>
    %cst_9 = arith.constant dense_resource<torch_tensor_10_84_torch.float32> : tensor<10x84xf32>
    %cst_10 = arith.constant dense_resource<torch_tensor_10_torch.float32> : tensor<10xf32>
    %0 = tensor.empty() : tensor<1x6x26x26xf32>
    %broadcasted = linalg.broadcast ins(%cst : tensor<6xf32>) outs(%0 : tensor<1x6x26x26xf32>) dimensions = [0, 2, 3] 
    %1 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%arg0, %cst_2 : tensor<1x1x28x28xf32>, tensor<6x1x3x3xf32>) outs(%broadcasted : tensor<1x6x26x26xf32>) -> tensor<1x6x26x26xf32>
    %2 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%1 : tensor<1x6x26x26xf32>) outs(%0 : tensor<1x6x26x26xf32>) {
    ^bb0(%in: f32, %out: f32):
      %42 = arith.cmpf ugt, %in, %cst_0 : f32
      %43 = arith.select %42, %in, %cst_0 : f32
      linalg.yield %43 : f32
    } -> tensor<1x6x26x26xf32>
    %3 = tensor.empty() : tensor<1x6x13x13xf32>
    %4 = linalg.fill ins(%cst_1 : f32) outs(%3 : tensor<1x6x13x13xf32>) -> tensor<1x6x13x13xf32>
    %5 = tensor.empty() : tensor<2x2xf32>
    %6 = linalg.pooling_nchw_max {dilations = dense<1> : vector<2xi64>, strides = dense<2> : vector<2xi64>} ins(%2, %5 : tensor<1x6x26x26xf32>, tensor<2x2xf32>) outs(%4 : tensor<1x6x13x13xf32>) -> tensor<1x6x13x13xf32>
    %7 = tensor.empty() : tensor<1x16x11x11xf32>
    %broadcasted_11 = linalg.broadcast ins(%cst_4 : tensor<16xf32>) outs(%7 : tensor<1x16x11x11xf32>) dimensions = [0, 2, 3] 
    %8 = linalg.conv_2d_nchw_fchw {dilations = dense<1> : vector<2xi64>, strides = dense<1> : vector<2xi64>} ins(%6, %cst_3 : tensor<1x6x13x13xf32>, tensor<16x6x3x3xf32>) outs(%broadcasted_11 : tensor<1x16x11x11xf32>) -> tensor<1x16x11x11xf32>
    %9 = linalg.generic {indexing_maps = [#map, #map], iterator_types = ["parallel", "parallel", "parallel", "parallel"]} ins(%8 : tensor<1x16x11x11xf32>) outs(%7 : tensor<1x16x11x11xf32>) {
    ^bb0(%in: f32, %out: f32):
      %42 = arith.cmpf ugt, %in, %cst_0 : f32
      %43 = arith.select %42, %in, %cst_0 : f32
      linalg.yield %43 : f32
    } -> tensor<1x16x11x11xf32>
    %10 = tensor.empty() : tensor<1x16x5x5xf32>
    %11 = linalg.fill ins(%cst_1 : f32) outs(%10 : tensor<1x16x5x5xf32>) -> tensor<1x16x5x5xf32>
    %12 = linalg.pooling_nchw_max {dilations = dense<1> : vector<2xi64>, strides = dense<2> : vector<2xi64>} ins(%9, %5 : tensor<1x16x11x11xf32>, tensor<2x2xf32>) outs(%11 : tensor<1x16x5x5xf32>) -> tensor<1x16x5x5xf32>
    %collapsed = tensor.collapse_shape %12 [[0], [1, 2, 3]] : tensor<1x16x5x5xf32> into tensor<1x400xf32>
    %13 = tensor.empty() : tensor<400x120xf32>
    %transposed = linalg.transpose ins(%cst_5 : tensor<120x400xf32>) outs(%13 : tensor<400x120xf32>) permutation = [1, 0] 
    %14 = tensor.empty() : tensor<1x120xf32>
    %15 = linalg.fill ins(%cst_0 : f32) outs(%14 : tensor<1x120xf32>) -> tensor<1x120xf32>
    %16 = linalg.matmul ins(%collapsed, %transposed : tensor<1x400xf32>, tensor<400x120xf32>) outs(%15 : tensor<1x120xf32>) -> tensor<1x120xf32>
    %17 = linalg.generic {indexing_maps = [#map1, #map2, #map1], iterator_types = ["parallel", "parallel"]} ins(%16, %cst_6 : tensor<1x120xf32>, tensor<120xf32>) outs(%14 : tensor<1x120xf32>) {
    ^bb0(%in: f32, %in_14: f32, %out: f32):
      %42 = arith.addf %in, %in_14 : f32
      linalg.yield %42 : f32
    } -> tensor<1x120xf32>
    %18 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%17 : tensor<1x120xf32>) outs(%14 : tensor<1x120xf32>) {
    ^bb0(%in: f32, %out: f32):
      %42 = arith.cmpf ugt, %in, %cst_0 : f32
      %43 = arith.select %42, %in, %cst_0 : f32
      linalg.yield %43 : f32
    } -> tensor<1x120xf32>
    %19 = tensor.empty() : tensor<120x84xf32>
    %transposed_12 = linalg.transpose ins(%cst_7 : tensor<84x120xf32>) outs(%19 : tensor<120x84xf32>) permutation = [1, 0] 
    %20 = tensor.empty() : tensor<1x84xf32>
    %21 = linalg.fill ins(%cst_0 : f32) outs(%20 : tensor<1x84xf32>) -> tensor<1x84xf32>
    %22 = linalg.matmul ins(%18, %transposed_12 : tensor<1x120xf32>, tensor<120x84xf32>) outs(%21 : tensor<1x84xf32>) -> tensor<1x84xf32>
    %23 = linalg.generic {indexing_maps = [#map1, #map2, #map1], iterator_types = ["parallel", "parallel"]} ins(%22, %cst_8 : tensor<1x84xf32>, tensor<84xf32>) outs(%20 : tensor<1x84xf32>) {
    ^bb0(%in: f32, %in_14: f32, %out: f32):
      %42 = arith.addf %in, %in_14 : f32
      linalg.yield %42 : f32
    } -> tensor<1x84xf32>
    %24 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%23 : tensor<1x84xf32>) outs(%20 : tensor<1x84xf32>) {
    ^bb0(%in: f32, %out: f32):
      %42 = arith.cmpf ugt, %in, %cst_0 : f32
      %43 = arith.select %42, %in, %cst_0 : f32
      linalg.yield %43 : f32
    } -> tensor<1x84xf32>
    %25 = tensor.empty() : tensor<84x10xf32>
    %transposed_13 = linalg.transpose ins(%cst_9 : tensor<10x84xf32>) outs(%25 : tensor<84x10xf32>) permutation = [1, 0] 
    %26 = tensor.empty() : tensor<1x10xf32>
    %27 = linalg.fill ins(%cst_0 : f32) outs(%26 : tensor<1x10xf32>) -> tensor<1x10xf32>
    %28 = linalg.matmul ins(%24, %transposed_13 : tensor<1x84xf32>, tensor<84x10xf32>) outs(%27 : tensor<1x10xf32>) -> tensor<1x10xf32>
    %29 = linalg.generic {indexing_maps = [#map1, #map2, #map1], iterator_types = ["parallel", "parallel"]} ins(%28, %cst_10 : tensor<1x10xf32>, tensor<10xf32>) outs(%26 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_14: f32, %out: f32):
      %42 = arith.addf %in, %in_14 : f32
      linalg.yield %42 : f32
    } -> tensor<1x10xf32>
    %30 = tensor.empty() : tensor<1xi64>
    %31 = linalg.fill ins(%c0_i64 : i64) outs(%30 : tensor<1xi64>) -> tensor<1xi64>
    %32 = tensor.empty() : tensor<1xf32>
    %33 = linalg.fill ins(%cst_1 : f32) outs(%32 : tensor<1xf32>) -> tensor<1xf32>
    %34:2 = linalg.generic {indexing_maps = [#map1, #map3, #map3], iterator_types = ["parallel", "reduction"]} ins(%29 : tensor<1x10xf32>) outs(%33, %31 : tensor<1xf32>, tensor<1xi64>) {
    ^bb0(%in: f32, %out: f32, %out_14: i64):
      %42 = linalg.index 1 : index
      %43 = arith.index_cast %42 : index to i64
      %44 = arith.maximumf %in, %out : f32
      %45 = arith.cmpf ogt, %in, %out : f32
      %46 = arith.select %45, %43, %out_14 : i64
      linalg.yield %44, %46 : f32, i64
    } -> (tensor<1xf32>, tensor<1xi64>)
    %expanded = tensor.expand_shape %34#0 [[0, 1]] output_shape [1, 1] : tensor<1xf32> into tensor<1x1xf32>
    %35 = linalg.generic {indexing_maps = [#map1, #map4, #map1], iterator_types = ["parallel", "parallel"]} ins(%29, %expanded : tensor<1x10xf32>, tensor<1x1xf32>) outs(%26 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_14: f32, %out: f32):
      %42 = arith.subf %in, %in_14 : f32
      linalg.yield %42 : f32
    } -> tensor<1x10xf32>
    %36 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%35 : tensor<1x10xf32>) outs(%26 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %out: f32):
      %42 = math.exp %in : f32
      linalg.yield %42 : f32
    } -> tensor<1x10xf32>
    %37 = tensor.empty() : tensor<1x1xf32>
    %38 = linalg.fill ins(%cst_0 : f32) outs(%37 : tensor<1x1xf32>) -> tensor<1x1xf32>
    %39 = linalg.generic {indexing_maps = [#map1, #map4], iterator_types = ["parallel", "reduction"]} ins(%36 : tensor<1x10xf32>) outs(%38 : tensor<1x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %42 = arith.addf %in, %out : f32
      linalg.yield %42 : f32
    } -> tensor<1x1xf32>
    %40 = linalg.generic {indexing_maps = [#map1, #map1], iterator_types = ["parallel", "parallel"]} ins(%39 : tensor<1x1xf32>) outs(%37 : tensor<1x1xf32>) {
    ^bb0(%in: f32, %out: f32):
      %42 = math.log %in : f32
      linalg.yield %42 : f32
    } -> tensor<1x1xf32>
    %41 = linalg.generic {indexing_maps = [#map1, #map4, #map1], iterator_types = ["parallel", "parallel"]} ins(%35, %40 : tensor<1x10xf32>, tensor<1x1xf32>) outs(%26 : tensor<1x10xf32>) {
    ^bb0(%in: f32, %in_14: f32, %out: f32):
      %42 = arith.subf %in, %in_14 : f32
      linalg.yield %42 : f32
    } -> tensor<1x10xf32>
    return %41 : tensor<1x10xf32>
  }
}

{-#
  dialect_resources: {
    builtin: {
      torch_tensor_6_torch.float32: "0x04000000EB3C84BDFA6F9CBE7B7F933DE0EF653D764C433E0099083C",
      torch_tensor_6_1_3_3_torch.float32: "0x0400000056EB33BEF8A03ABE76294D3EA6D561BE807420BE03AE393ECED27DBE4366273E93D94F3EC649B93D6BB6743DCEF3033EE61B813EAB24DE3CA3BE75BEDA789D3E864C7A3E5613FDBBD68A47BE763404BEE3B096BEA334623E40F7ECBC882C6B3EF684003E2B6E87BD38435ABE4097ED3D76035BBEDBB697BD90EA4A3E7EDE39BE409685BC405039BD16741C3D6C52A43E4B88473E732700BE1A08973EBB07DEBDA39C0C3E9B3E0D3ED65A25BCD3D19EBE4E72A03EEBAF9DBD4873683E53B94CBE2B520BBD1050923E681794BED6C5523CAB7E8EBBA4DD91BE",
      torch_tensor_16_6_3_3_torch.float32: "0x04000000D57060BD37F748BDEB1850BD1DD0D83DCF9F323D4BBE0ABE1E4CC73C74D994BC1E51CB3DB10923BD9942F33D213D2C3DCB19FBBDFE7AEA3C1376FEBC25838B3D5336EFBD5D1B23BCCC30B83D9989453D9B22833D43F7EB3D8E99633D7513353D3BE1E53C9ABE123C5391F23D788B00BDA7B5923C65DFF73AF9151ABD96C5CB3DB436FA3B060BEDBD500CBD3DDE7738BDD8E6593C29B7FCBD75295D3DBF1EBFBD4CD47CBC783FEF3D685F053D9160E83D0C1197BD3DA201BEAD20DFBD3AEA3EBD05932DBDB74D17BCF95D9F3D180EF33DEEB308BECFAEA1BD4896EF3D18E0B9BC5A381DBD1F0309BE7B27B6BCE4ACF7BD281AEC3D90BF7FBDB3062CBD34CDCF3C983D7D3DFA6EF33D2D80BCBC2708D0BD9E7EF33D1654ECBC16964B3D53D9D2BDC98DB2BD213627BC7DEB38BDE55E9D3B2210523DD7AF5A3C799671BDAA2A51BBA562D73DAB25F43D1462E83D7263B83DDD04993D22210A3E2D8301BE6F34F4BDD26CA63D31F4053ECF1EC5BD150B793D0E9490BD041DCABC790D043EE557A4BDB6FD853DB86ECC3D58F8863DCE28BEBDA41E2B3D7DB1FBBDE2B08FBD0AE3A1BDDA9EBD3D82B4023D9928063E6764B43D152629BDC972063E4AB0B9BD866A2BBD620D11BD81645E3D17426FBDA766DDBD1CD3AA3D8C34E63D8F66A93DADE49C3DB7F331BD97A83FBD1970F4BD0C8F493B26CEB33DCE40903D8041EF3DFB0FD8BDB1D0F3BDC129823D7CE8073ED3E53BBD6DA8C93C0321203D6A93913D70C8A53C2437EFBD2E41C4BC8D26903D7537D1BB56C3C9BD99CEAEBDCB8A37BD6C13D03DB941B23CEB2BD03D4B4A5B3C0407AB3D0BD4553C51CABE3D3234F13DAE12E9BD9A55CDBDC6634FBDF61A6BBB5AA532BD8069EFBDB674C23A8E8DB63DC84ADFBD0694FA3CB19AB3BD65A8893D7FC0A2BCC636C83DAAD48F3D9CF1C7BD27F6E93DF19EF8BD8BCA54BC0EB6943D45F0503DCC83D8BD38EF303C4E525BBD0B510DBD7F73EBBDC628303D73F1DF3DC4C3703DB71D473D109CADBD6528A3BD16C85E3C88B7433D4B7AACBD117203BEE464E0BB925B0ABD84AA4B3D7658D83B36ACB1BD66E418BDF34BFDBC224AF9BD26789C3D6245CF3DE1DEDDBDE587863D2AEF9BBDFD3D753CE665C6BDAE69B3BD7FCBE4BDFFCE683D735AABBDB29C26BDEFA3933DC36A2EBD8920FB3D657B913DF433693D0239843D587964BD600BD9BC440AE13C978D94BD8B0EDB3D3FD4B3BD4CA549BCB82193BD2F8A49BDA2CC063ED57D023E86F99BBD01B56B3D7B16203C7A7010BDD0BF72BD630D9EBCFB11883D938F5E3DC2C48C3B7E8FD7BDB39EE73C6027A93DC76867BCB071953D227681BDCD6398BB572BB83D808C82BD2E4E2ABD343243BCB4F108BE340B7C3D619CD1BD1E48263C9B67D4BD6C8E7FBD2FEBBDBD87A2053EC795663C66BACFBDAC68013E81C1B5BD32508CBD3F59853C630401BED2EEB23CF6D3A33D8A260B3EE6E3BFBDFCDAE63D943CD4BD2CDC933CB66BB93DF653FA3C015BDF3D99110A3E21F594BD9D52BEBDC7DCC23D79F71C3DDD71ACBD30D2E4BBF6CD7A3CF3328E3DEE1AECBBFF17C7BCBA5F5B3A282BD2BD3AB73ABDE7280BBE71FF6B3CAE5A003C16B1F33DFBF1E7BCEB43CDBC6B40ADBD32FB09BE424203BE16B09A3B4901893D1D0F22BDA00DB13DB0EFAF3C78688CBD1785B63D6790C2BD4AB9263DE52A063EEBB3063D6560653D28E58BBD947C94BCBF82EFBD2DD9D93DE7AF183D58BF14BDEC87E7BD860A14BDBB098B3D3423C63DE1D792BCF749CABDD19D03BEF818053E8373413B20A0163D356BCCBD63CBA9BD4C84F3BDE1DAB73D854C00BEF440AABD0CC4AD3D327AEFBD3D68D23D5A14BABD5AD78B3D4C0D20BD1366143D0EBD3C3D7DE46FBD89E76DBDE8B8033E166DA23D31F2093ED641E23D21E469BDB041EF3D4B8975BD7B1565BD66DA6C3B9D27CDBC46EF223CA0B4073E9D8F35BD11556B3DCB099DBDA11FBDBDF997F83D2838F83C07EE073EBAED103D699A58BD65AF1EBD42EBBBBD5077F9BDA5A1003E312BE9BD8B8FB9BD2641BABDF32DDCBDB3E2DA3C723D603DF5F4F3BD6684933DCAD3EA3B26EDB4BDB9AB8B3D70F97ABDC032F6BD72D024BDD25F2ABC8C202B3DA7BB32BB115086BDB295543D348C0A3EE3D8EFBD91CE82BD173F0CBDE92462BD3B56F8BC8B0B91BD8D11973D100604BEA7E4743D589EC7BAC974E13C50031D3B4E6DC4BAF650FDBDCB86FBBC6D1E38BDADA2053ECC65903B0175B7BDAB81A2BD5FC36A3D1BC9763D439C5D3DF50569BD674A243D29E1B53DFCDCA0BD7B380A3E9140D73DE17F443CDEB7FF3D9B84203D7254043D02A070BD842CB03D3203CDBD57B5893D9C1EB13CB630063E7AE9DD3D9E54FA3DE485913D2F7F2FBD9D4AAEBC9FC5BC3DB052023E03F6643D56BC043EB6716BBD89A5A83D950906BEF1BEB6BDD69E953DA851053EAA4AAF3D5A03D53D83B5CBBDA80801BEE688893D4E14B0BD612704BEFE0EC93B447D243DBCDF38BDBF6C003DAF8208BE043C75BC50485A3D8AA1B9BD8F749A3D50C60D3DE1602BBD1246933DC989F03D07884739E32DE13CB0FCD2BD6086A63B05B4713C89D4C6BC67110C3D043597BA5FC2853B2D89E53DC7482BBD29A1DABD8BD21CBDEAF6CFBD19FF73BD9121A53D0E8DCA3D9BDFE63B017829BD206448BD813DC1BDFF42923DD0998D3DFDC308BC8CDDE0BD9DEB013DE522D0BD6A22D4BBD48350BB288D843CF65B88BD435B0ABE6A7365BDBC97FB3C1F08EE3DDF3D663DFBC09FBD41E8BB3D4D0AF33CAFBFC5BDA695F3BCECF0A2BD87045A3D1630A53D199AAD3DAF0CEDBD0536BC3D226F973D51E8523D326608BE2B2AFDBCC18855BDF43B55BD3CB7093B1DB8A6BD5E0A3DBCED79883CA5F2053D7068A7BD0E47F33DA0D1073DC19709BE0CC32B3D00DA023E009E04BEFB54B43D4713FE3D4796F0BD7999EF3C803CDDBD5E94DABDF21CED3C279FBE3DFB6A393D459F01BE9624A33CCCD3EDBD24F1ADBB929CD3BD97E407BDE9FF4C3CC20F863DF0A4BABCABBC253D377DCEBDBE7F11BD241BCBBDD5ED88BACFB7A63C9F914D3D2014E43D3488D43DE507DEBDBB6AEABB222AD3BCE66B513D1FFC08BED473F53DF3D9913C5CDC64BDA08AE1BCB397B9BCD702EBBD6613963D6680BEBD33F58A3D0018863D0830F5BD6EAF2D3D918481BDD160E33D94380B3ED06648BD8D3E813C5B1EC8BD194BC7BCE61EA8BCA9AF823DC59CE3BD2C85B1BD46A66E3D299EA8BD1070C33D19E4193CB896863D248906BE66D5EC3D228D44BD0C379BBC3563B6BD91FE553DA781A13D5AC2733DA1D8ADBDBE2D9E3CA795B5BD362020BC9FBD81BD1984D93D75BD8EBC202DBEBD5F9B033BD2CBE3BAF68284BDC86A0DBCD04425BDD33F2DBC66CFF0BBFF11963DDEF138BD61D0EA3D07CBDB3C1F46E2BDCC4F9DBD588EC5BACE55E03D3464EC3DD820AC3DA52B9D3D3FDDFCBCC0D60BBBC846423DAEFBFB3DD430BA3D2106AE3DEBC28A3DF390E63C810FD5BC9B882CBDD2D9B5BD92FBB2BD5746E43D336DDE3D124080BD3CA6E43C14D0B4BCD1AB29BDE23C303B3E73B5BDE1029FBC14252F3D0261E5BD2075FFBC0A42A23D5EE63B3DA773003D1640E7BB4ACBD93DD43B3C3D360EB1BC3FF175BDDFAC97BCE441E1BD434FE0BDFBCB023EE92BEB3D0F1D9DBDCE2DA9BC3569093DADA9EBBCF3121E3D6B2D04BE914E143D18EB043E0400A43C70F4D23D4848663C2D99F7BD62624D3DC7A1C6BC2A45073E028B073E7DC9D4BCB9E508BEA55924BD35CF9A3DC82F773C3979073D48F2083E321FDEBD1B88C1BDCDBC30B98CEC8E3D67C6F5BDB5D46ABDE3D503BED0C2D5BDEA21DC3C3D1EEDBD38FA74BCFFE56BBDDC20FE3D406A573D7A9E463D7B10D93CA24A9EBD23A5B93D4780E33D6915113D1F87F3BD03ECCE3D039CF3BA2310733DB185B13D96689CBDAAA2FBBDAA73F8BDAF8CE73D4782003E9D23A03C75C7E03D11E9D83D181D07BD62445DBC1E3DDFBCAB10093EA950A83D9B7B763CA4A91ABD1499303D961E0A3E807C66BDB7FCD83DB586513D05CDDD3D9909E3BDFEC23F3D254B0B3E20B8753CF396B13D4238973DD751723D1834BCBD7DFD21BD531C7B3DC804013EFCCA06BDA285C93D1A72323C190DF6BDA4D5033EF40B293D88AE8DBD73A5AE3C5D51053E6BF4353D54DED1BCB80504BDAF19F13DF1DDE13D17B494BDAA6F92BD5218C13D2EE32BBCD00E9FBD0D40A8BD186A24BDCF94D1BC50E406BE716EE0BD878A97BDAAB3D5BDD1DD423D726F73BC42251FBD9E872CBD78D1ACBD16ABC13D54AA423C7168EEBBAD8CADBD13BCF63CC55DB3BD1E0E00BE15B54FBDC5FBBA3DEC50E63D4CE6173D0F17673D16A0E03C285EECBC392E8D3BDE05803CDB10EE3D034C913DC10885BCD01603BE16C4ADBD29F4703DF06105BD96437E3C55E5893D6DF668BD0EDB32BD51E0B33D6C70543DEE2197BC487DC23CA9F9F7BC3F8B8CBD6AC4C73D3B14A9BD7DE5E4BD2992E43CF3AD9BBCCFDC56BD3FF9E7BD906F89BD893E78BD451D3B3CA7807E3D6168ECBDFCDEBE3D9E557BBD15D6013EF011F6BD7B5AF83DC06A9D3D45DD043E270A2F3BCA9C013EDDAAF5BD80CF07BEC046C73DB7E5A4BD69A413BD9B2D51BDCB6D9B3D77DA09BDAE1303BD507AF73D79F2AE3C6F8560BD1E044BBD444A96BDC1AF693DE838103D47667C3B0378DA3C133CDDBD9C3985BB236DB73D0785DB3DFEC49DBC91DE693CB172A73DC58BD4BDFA46093EB5567B3DA261F5BD5A41D0BC43C87ABD75D7193DA8D236BD0DE32FBDA9A0443D5647F83D406B92BDB8D22C3DFCD3B93DE804993DA5E49B3D4A41A93D609B33BCB3AFB13D0D1600BEE6DE4ABC068FEDBD8D4E68BC",
      torch_tensor_16_torch.float32: "0x04000000A5FAD9BC9B1F1E3D2AAFB03DDA3050BDEC8506BED23FF4BC14433A3D4333BFBDFC41E9BD8B83C2BBB30AF73BB2FA383C5BC3A1BD8AA290BD1E0908BEA378893B",
      torch_tensor_120_400_torch.float32: 